# Пицхелаури С. Г. М8О-305Б-18
# 21. 10гранная прямая правильная усеченная пирамида
import numpy as np
from math import sqrt
import matplotlib.pyplot as plt
from mpl_toolkits.mplot3d import Axes3D
from mpl_toolkits.mplot3d.art3d import Poly3DCollection, Line3DCollection

#оменять цвет
def choose_color(color, view):
	if color == 1:
	    cl = (1, 0, 1, 1)
	if color == 2:
		cl = (1, 1, 1, 1)
	if color == 3:
		cl = (1, 1, 0, 1)
	if color == 4:
		cl = (0, 0, 1, 1)
	return cl

#стороны 10гранной прямой правильной усеченной пирамиды
def make_sides(p):
	sides = [[p[0],p[1],p[2],p[3],p[4],p[5],p[6],p[7],p[8],p[9]],
		[p[10],p[11],p[12],p[13],p[14],p[15],p[16],p[17],p[18],p[19]],
                [p[20],p[21],p[22],p[23],p[24],p[25],p[26],p[27],p[28],p[29]],
		[p[30],p[31],p[32],p[33],p[34],p[35],p[36],p[37],p[38],p[39]],
			 [p[0],p[1],p[11],p[10]],
			 [p[1],p[2],p[12],p[11]],
			 [p[2],p[3],p[13],p[12]],
			 [p[3],p[4],p[14],p[13]],
			 [p[4],p[5],p[15],p[14]],
                         [p[5],p[6],p[16],p[15]],
			 [p[6],p[7],p[17],p[16]],
			 [p[7],p[8],p[18],p[17]],
			 [p[8],p[9],p[19],p[18]],
			 [p[9],p[0],p[10],p[19]],
                         [p[20],p[21],p[31],p[30]],
			 [p[21],p[22],p[32],p[31]],
			 [p[22],p[23],p[33],p[32]],
			 [p[23],p[24],p[34],p[33]],
			 [p[24],p[25],p[35],p[34]],
                         [p[25],p[26],p[36],p[35]],
			 [p[26],p[27],p[37],p[36]],
			 [p[27],p[28],p[38],p[37]],
			 [p[28],p[29],p[39],p[38]],
			 [p[29],p[20],p[30],p[39]]]
	return sides
#координаты 
def plot_upir(R, height, color, view):
	points = np.array([[-1.5, 0.8, -1.],
                                           [-1.075, 0.5, -1.],
					   [-0.925, 0., -1.],
					   [-1.075, -0.5, -1.],
					   [-1.525, -0.8, -1.],
					   [-2.055, -0.8, -1.],
					   [-2.475, -0.5, -1.],
					   [-2.625, 0., -1.],
					   [-2.475, 0.5, -1.],
					   [-2.055, 0.8, -1.],
                           
                                           [-1.6375, 0.4, 0.],
					   [-1.425, 0.25, 0.],
					   [-1.35, 0., 0.],
					   [-1.425, -0.25, 0.],
					   [-1.6375, -0.4, 0.],
					   [-1.9125, -0.4, 0.],
					   [-2.125, -0.25, 0.],
					   [-2.2, 0., 0.],
					   [-2.125, 0.25, 0.],
					   [-1.9125, 0.4, 0.],

                                           [1.6375, -0.75, -0.225],
					   [1.85, -0.75, -0.325],
					   [1.925, -0.75, -0.5],
					   [1.85, -0.75, -0.675],
					   [1.6375, -0.75, -0.775],
					   [1.3625, -0.75, -0.775],
					   [1.15, -0.75, -0.675],
					   [1.075, -0.75, -0.5],
					   [1.15, -0.75, -0.325],
					   [1.3625, -0.75, -0.225],
                           
                                           [1.775, 0.75, 0.05],
                                           [2.2, 0.75, -0.2],
					   [2.35, 0.75, -0.5],
					   [2.2, 0.75, -0.8],
					   [1.775, 0.75, -1.05],
					   [1.225, 0.75, -1.05],
					   [0.8, 0.75, -0.8],
					   [0.65, 0.75, -0.5],
					   [0.8, 0.75, -0.2],
					   [1.225, 0.75, 0.05]])

	points[:, :-1] *= R * 0.5
	points[:, -1] *= height * 0.5


	# построение

	fig = plt.figure()
	ax = fig.add_subplot(111, projection="3d")

	prisms = [make_sides(points)]

	for i in range(len(prisms)):
		ax.add_collection3d(Poly3DCollection(prisms[i], linewidths=view, facecolors = choose_color(color, view), edgecolors='k'))

        # дорисовка
	ax.set_xlabel('X')
	ax.set_ylabel('Y')
	ax.set_zlabel('Z')
	ax.set_title('Выполнила: Пицхелаури Софья (305Б) \n\n ортографическая                |               изометрическая')
        
	limit = height * 0.5 * 1.2
	plt.xlim([-limit, limit])
	plt.ylim([-limit, limit])
	ax.set_zlim(-limit, limit)

	plt.show()
#построение
plot_upir(1., 2., 3, 1)
